stat/questions.org

#+TITLE: Stat Questions
#+AUTHOR: Sreejith Sreekumar
#+LATEX_HEADER: \usepackage[margin=.5in]{geometry}


* Standard error of median
   - [[https://archive.ph/eW8MS]]
* Interpret standard error of the mean
* How to generate a matrix that follows bernoulli distribution in python
  
  #+begin_SRC ipython :session
   import numpy as np

   def bernoulli_pmf(x,p=0.5):

      f = p**x*(1-p)**(1-x)
      return f


   def get_random_bernoulli(p=0.5):

       if np.random.rand() <= p:
           return 0
       else:
           return 1

   bernoulli = np.array([[get_random_bernoulli() for j in range(4)] for i in range(4)])

   print(bernoulli)

  #+end_SRC

  #+RESULTS:
  : # Out[2]:
  
* Divide each element of the matrix with sum of columns
*
  
* There are four people in an elevator, four floors in the building, and each person exits at random. Find the probability that:
  a) all exit at different floors
  b) all exit at the same floor
  c) two get off at one floor and two get off at another
* https://stats.stackexchange.com/questions/171451/check-whether-a-coin-is-fair
* What is the expected value of flips to get heads on a fair coin?
* https://quizlet.com/565183311/probstats-and-ml-interview-questions-flash-cards/
*  https://www.kaggle.com/getting-started/37489
* https://www.glassdoor.com/Interview/Google-Data-Scientist-Interview-Questions-EI_IE9079.0,6_KO7,21.htm
* https://igotanoffer.com/blogs/tech/google-data-science-interview
* https://www.statisticshowto.com/probability-and-statistics/confidence-interval/
* https://archive.ph/V8Gky



  (0.2*0.25) + (.15* )
