stat/questions.tex
% Created 2021-12-28 Tue 00:25
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[margin=.5in]{geometry}
\author{Sreejith Sreekumar}
\date{\today}
\title{Stat Questions}
\hypersetup{
 pdfauthor={Sreejith Sreekumar},
 pdftitle={Stat Questions},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.2 (Org mode 9.4.4)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents



\section{Standard error of median}
\label{sec:org21157ce}
\begin{itemize}
\item \url{https://archive.ph/eW8MS}
\end{itemize}
\section{Interpret standard error of the mean}
\label{sec:org2aa3227}
\section{How to generate a matrix that follows bernoulli distribution in python}
\label{sec:org93c4450}

\begin{verbatim}
import numpy as np

def bernoulli_pmf(x,p=0.5):

   f = p**x*(1-p)**(1-x)
   return f


def get_random_bernoulli(p=0.5):

    if np.random.rand() <= p:
        return 0
    else:
        return 1

bernoulli = np.array([[get_random_bernoulli() for j in range(4)] for i in range(4)])

print(bernoulli)

\end{verbatim}

\section{Divide each element of the matrix with sum of columns}
\label{sec:orga9ac805}
*

\section{There are four people in an elevator, four floors in the building, and each person exits at random. Find the probability that:}
\label{sec:orgec95656}
a) all exit at different floors
b) all exit at the same floor
c) two get off at one floor and two get off at another
\section{\url{https://stats.stackexchange.com/questions/171451/check-whether-a-coin-is-fair}}
\label{sec:org95bdb29}
\section{What is the expected value of flips to get heads on a fair coin?}
\label{sec:orgac9681b}
\section{\url{https://quizlet.com/565183311/probstats-and-ml-interview-questions-flash-cards/}}
\label{sec:org68a803d}
\section{\url{https://www.kaggle.com/getting-started/37489}}
\label{sec:org4b7c64b}
\section{\url{https://www.glassdoor.com/Interview/Google-Data-Scientist-Interview-Questions-EI\_IE9079.0,6\_KO7,21.htm}}
\label{sec:org0581453}
\section{\url{https://igotanoffer.com/blogs/tech/google-data-science-interview}}
\label{sec:org4824888}
\section{\url{https://www.statisticshowto.com/probability-and-statistics/confidence-interval/}}
\label{sec:orgfbbbbe1}
\section{\url{https://archive.ph/V8Gky}}
\label{sec:org9ff0a60}



(0.2*0.25) + (.15* )
\end{document}
